import sys
from scripts import test, 지역별주문수, 결제수단, 유저별주문, 월별주문, 시간대별, 인기상품, 신발사이즈별, 옷사이즈별, 월별매출예측_ARIMA, 성별별구매, \
    남성구매, 여성구매, 기타성별구매, 월별매출, 카테고리성별구매, 일별매출예측_선형회귀, 월별매출예측_선형회귀, 월별매출예측_다항회귀, 시간성별구매, 판매금액, 상품가격분포

routes = {
    "test": test.test,
    "지역별주문수": 지역별주문수.지역별주문수,
    "결제수단": 결제수단.결제수단,
    "유저별주문": 유저별주문.유저별주문,
    "월별주문": 월별주문.월별주문,
    "시간대별": 시간대별.시간대별,
    "인기상품": 인기상품.인기상품,
    "신발사이즈별": 신발사이즈별.신발사이즈별,
    "옷사이즈별": 옷사이즈별.옷사이즈별,
    "월별매출예측_ARIMA": 월별매출예측_ARIMA.월별매출예측_ARIMA,
    "성별별구매": 성별별구매.성별별구매,
    "남성구매": 남성구매.남성구매,
    "여성구매": 여성구매.여성구매,
    "기타성별구매": 기타성별구매.기타성별구매,
    "월별매출": 월별매출.월별매출,
    "카테고리성별구매": 카테고리성별구매.카테고리성별구매,
    "일별매출예측_선형회귀": 일별매출예측_선형회귀.일별매출예측_선형회귀,
    "월별매출예측_선형회귀": 월별매출예측_선형회귀.월별매출예측_선형회귀,
    "월별매출예측_다항회귀": 월별매출예측_다항회귀.월별매출예측_다항회귀,
    "시간성별구매": 시간성별구매.시간성별구매,
    "판매금액": 판매금액.판매금액,
    "상품가격분포": 상품가격분포.상품가격분포
}

def route_request(route, is_chart):
    if route in routes:
        if is_chart:
            return routes[route]()
        else:
            return routes[route](False)
    else:
        print("올바르지 못한 라우트입니다.")

if __name__ == "__main__":
    arg_len = len(sys.argv)

    if arg_len > 1:
        route = sys.argv[1]
        is_chart = True

        if arg_len > 2:
           is_chart = sys.argv[2] != "none"

        print(route_request(route, is_chart))
    else:
        print("라우트를 제공해주세요.")

